In [ ]:
import pandas as pd
import numpy as np

In [2]:
#Series

In [5]:
s = pd.Series([23, 45, 67, 12, 120, 56])
s

0     23
1     45
2     67
3     12
4    120
5     56
dtype: int64

In [8]:
s = pd.Series([23, 45, 67, 12, 120, 56.0])
s[2] = 10 #values tored are immutable
s

0     23.0
1     45.0
2     10.0
3     12.0
4    120.0
5     56.0
dtype: float64

In [12]:
s = pd.Series([23, 45, 67, 12, 120, 56])
s[6] = 33
s

0     23
1     45
2     67
3     12
4    120
5     56
6     33
dtype: int64

In [16]:
s = pd.Series([23, 45, 67, 12, 120, 56], index = range(100,  106))#can assign index of our own
s

100     23
101     45
102     67
103     12
104    120
105     56
dtype: int64

In [18]:
s[101]

45

In [19]:
##DataFrame

In [20]:
roll = pd.Series([1, 2, 3, 4, 5])
name = pd.Series(['Shruti', 'sia', 'ria', 'disha', 'Ravi'])
marks = pd.Series([98, 56, 87, 64,89])

In [21]:
name

0    Shruti
1       sia
2       ria
3     disha
4      Ravi
dtype: object

In [23]:
df = pd.DataFrame({
    'roll' : roll,
    'name' : name,
    'makrs' : marks
})
df

   roll    name  makrs
0     1  Shruti     98
1     2     sia     56
2     3     ria     87
3     4   disha     64
4     5    Ravi     89

In [24]:
df.shape

(5, 3)

In [25]:
df.size

15

In [26]:
df.columns

Index(['roll', 'name', 'makrs'], dtype='object')

In [27]:
#current working directories

In [29]:
import os
os.getcwd()

'C:\\Users\\Ketaki'

In [30]:
"""
location => https://mitu.co.in/dataset
download all the files starting from student*.csv
eg..... student1.csv, student.csv......

put them into the same directory as your jupyter notebook files
"""

'\nlocation => https://mitu.co.in/dataset\ndownload all the files starting from student*.csv\neg..... student1.csv, student.csv......\n\nput them into the same directory as your jupyter notebook files\n'

df = pd.read_csv("student1.csv")
df

In [35]:
df =  pd.read_csv("student1.csv")
df

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [37]:
headers = ["A", "B", "C", "D", "E"]
df1 = pd.read_csv("student1.csv", names = headers)
df1

    A        B   C      D   E
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [48]:
df = pd.read_csv("student3.tsv")
df = pd.read_csv("student3.tsv", sep="\t")
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [49]:
df.shape

(10, 5)

In [50]:
df.size

50

In [51]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 532.0+ bytes

In [53]:
df.T

,0,1,2,3,4,5,6,7,8,9
roll,1,2,3,4,5,6,7,8,9,10
name,anil,amit,aniket,ajinkya,asha,ayesha,amar,amita,amol,anmol
class,TE,TE,BE,TE,TE,BE,BE,BE,TE,BE
marks,56.77,59.77,76.88,69.66,63.28,49.55,65.34,68.33,56.75,78.66
age,22,21,19,20,20,20,19,23,20,21

In [54]:
df.dtypes

roll       int64
name      object
class     object
marks    float64
age        int64
dtype: object

In [55]:
df.head(3)

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19

In [56]:
df.tail()

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [57]:
df.iloc[2:5, 0:3]

   roll     name class
2     3   aniket    BE
3     4  ajinkya    TE
4     5     asha    TE

In [58]:
df.iloc[[5, 6, 8],  0:3]

   roll    name class
5     6  ayesha    BE
6     7    amar    BE
8     9    amol    TE

In [60]:
df.loc[:,'name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [62]:
df.drop(9)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20

In [63]:
df.drop('roll', axis = 1)

      name class  marks  age
0     anil    TE  56.77   22
1     amit    TE  59.77   21
2   aniket    BE  76.88   19
3  ajinkya    TE  69.66   20
4     asha    TE  63.28   20
5   ayesha    BE  49.55   20
6     amar    BE  65.34   19
7    amita    BE  68.33   23
8     amol    TE  56.75   20
9    anmol    BE  78.66   21

In [64]:
#renaming

In [66]:
col = {'roll' : 'id'}
df.rename(columns = col)

   id     name class  marks  age
0   1     anil    TE  56.77   22
1   2     amit    TE  59.77   21
2   3   aniket    BE  76.88   19
3   4  ajinkya    TE  69.66   20
4   5     asha    TE  63.28   20
5   6   ayesha    BE  49.55   20
6   7     amar    BE  65.34   19
7   8    amita    BE  68.33   23
8   9     amol    TE  56.75   20
9  10    anmol    BE  78.66   21

In [75]:
df = df.rename(index={1: 'one' ,2:'two' , 3: 'three'})
df

       roll     name class  marks  age
0         1     anil    TE  56.77   22
one       2     amit    TE  59.77   21
two       3   aniket    BE  76.88   19
three     4  ajinkya    TE  69.66   20
4         5     asha    TE  63.28   20
5         6   ayesha    BE  49.55   20
6         7     amar    BE  65.34   19
7         8    amita    BE  68.33   23
8         9     amol    TE  56.75   20
9        10    anmol    BE  78.66   21

In [77]:
df['roll'] = df['roll'] + 100
df

       roll     name class  marks  age
0       201     anil    TE  56.77   22
one     202     amit    TE  59.77   21
two     203   aniket    BE  76.88   19
three   204  ajinkya    TE  69.66   20
4       205     asha    TE  63.28   20
5       206   ayesha    BE  49.55   20
6       207     amar    BE  65.34   19
7       208    amita    BE  68.33   23
8       209     amol    TE  56.75   20
9       210    anmol    BE  78.66   21

In [87]:
#Question1:
#create a series using a list of 5 fruits names.assign custom index lables to each element

fruits = ['Apple', 'Banana', 'Cherry', 'Mango', 'Orange']
labels = ['A', 'B', 'C', 'D', 'E']

fruit_series = pd.Series(fruits, index=labels)
print(fruit_series)

A     Apple
B    Banana
C    Cherry
D     Mango
E    Orange
dtype: object

In [102]:
#Question2 :
#create a dataFram 

name = pd.Series(['Alice', 'Bob', 'charlie'])
Age = pd.Series([23, 30, 35])
city = pd.Series(['Pune','Mumbai', 'Nagppur'])

df = pd.DataFrame({
    'name': name,
    'Age' : Age,
    'city': city
})

df

      name  Age     city
0    Alice   23     Pune
1      Bob   30   Mumbai
2  charlie   35  Nagppur

In [105]:
#Question3:
data = np.random.randint(1, 101, size=(3, 3))

df1 = pd.DataFrame(data, columns=['A', 'B', 'C'])

print(df1)

    A   B   C
0  61  39  10
1  69  91  28
2  54  49  86

In [104]:
#question4:
#Using the dataframe from question3 display :- first 2 rows-last row -shape of the data frame
df[:2]

    name  Age    city
0  Alice   23    Pune
1    Bob   30  Mumbai

In [107]:
df.iloc[-1]

name    charlie
Age          35
city    Nagppur
Name: 2, dtype: object

In [108]:
df.shape

(3, 3)

In [109]:
#Question5:
#use .info() and describe() on the dataframe created in question2

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   Age     3 non-null      int64
 2   city    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [110]:
df.describe()

             Age
count   3.000000
mean   29.333333
std     6.027714
min    23.000000
25%    26.500000
50%    30.000000
75%    32.500000
max    35.000000

In [114]:
#question6:-
#from the Dataframe in question2 select only the "Name" and 'City' columns using loc

df.loc[:,["name", "city"]]

      name     city
0    Alice     Pune
1      Bob   Mumbai
2  charlie  Nagppur

In [116]:
#question7:-
#From the Dataframe in Question 2, use iloc to display the second row

df.iloc[1:2]

  name  Age    city
1  Bob   30  Mumbai

In [133]:
#question8:-
#Rename the 'Age' column to 'years' in the dataframe from the questipn 2
df = df.rename(columns={'Age': 'years'})
print(df)

      name  years     city
0    Alice     33     Pune
1      Bob     40   Mumbai
2  charlie     45  Nagppur

In [134]:
#Question9:-
#drop the "City" column from the dataframe in the question2
df.drop('city',axis = 1)

      name  years
0    Alice     33
1      Bob     40
2  charlie     45

In [135]:
#Question10:-
#modify the years column (previously Age) by adding 5 to each value

df['years'] = df['years'] + 5
df

      name  years     city
0    Alice     38     Pune
1      Bob     45   Mumbai
2  charlie     50  Nagppur